# FabricationPartRouteEnd Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationPartRouteEnd Properties
FabricationPartRouteEnd Class See Also
---
The FabricationPartRouteEnd type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FabricationPartRouteEnd Class
Autodesk.Revit.DB.Fabrication Namespace